tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_1.h
#ifndef AO_CAN_FILTER_IDE_1_9

#define AO_CAN_FILTER_IDE_1_9           (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_9

#define AO_CAN_FILTER_MASK_1_9          (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_9

#define AO_CAN_FILTER_SID_1_9           (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_10

#define AO_CAN_FILTER_EID_1_10          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_10

#define AO_CAN_FILTER_ENABLE_1_10       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_10

#define AO_CAN_FILTER_FIFO_1_10         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_10

#define AO_CAN_FILTER_IDE_1_10          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_10

#define AO_CAN_FILTER_MASK_1_10         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_10

#define AO_CAN_FILTER_SID_1_10          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_11

#define AO_CAN_FILTER_EID_1_11          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_11

#define AO_CAN_FILTER_ENABLE_1_11       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_11

#define AO_CAN_FILTER_FIFO_1_11         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_11

#define AO_CAN_FILTER_IDE_1_11          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_11

#define AO_CAN_FILTER_MASK_1_11         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_11

#define AO_CAN_FILTER_SID_1_11          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_12

#define AO_CAN_FILTER_EID_1_12          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_12

#define AO_CAN_FILTER_ENABLE_1_12       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_12

#define AO_CAN_FILTER_FIFO_1_12         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_12

#define AO_CAN_FILTER_IDE_1_12          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_12

#define AO_CAN_FILTER_MASK_1_12         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_12

#define AO_CAN_FILTER_SID_1_12          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_13

#define AO_CAN_FILTER_EID_1_13          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_13

#define AO_CAN_FILTER_ENABLE_1_13       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_13

#define AO_CAN_FILTER_FIFO_1_13         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_13

#define AO_CAN_FILTER_IDE_1_13          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_13

#define AO_CAN_FILTER_MASK_1_13         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_13

#define AO_CAN_FILTER_SID_1_13          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_14

#define AO_CAN_FILTER_EID_1_14          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_14

#define AO_CAN_FILTER_ENABLE_1_14       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_14

#define AO_CAN_FILTER_FIFO_1_14         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_14

#define AO_CAN_FILTER_IDE_1_14          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_14

#define AO_CAN_FILTER_MASK_1_14         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_14

#define AO_CAN_FILTER_SID_1_14          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_15

#define AO_CAN_FILTER_EID_1_15          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_15

#define AO_CAN_FILTER_ENABLE_1_15       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_15

#define AO_CAN_FILTER_FIFO_1_15         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_15

#define AO_CAN_FILTER_IDE_1_15          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_15

#define AO_CAN_FILTER_MASK_1_15         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_15

#define AO_CAN_FILTER_SID_1_15          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_16

#define AO_CAN_FILTER_EID_1_16          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_16

#define AO_CAN_FILTER_ENABLE_1_16       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_16

#define AO_CAN_FILTER_FIFO_1_16         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_16

#define AO_CAN_FILTER_IDE_1_16          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_16

#define AO_CAN_FILTER_MASK_1_16         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_16

#define AO_CAN_FILTER_SID_1_16          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_17

#define AO_CAN_FILTER_EID_1_17          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_17

#define AO_CAN_FILTER_ENABLE_1_17       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_17

#define AO_CAN_FILTER_FIFO_1_17         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_17

#define AO_CAN_FILTER_IDE_1_17          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_17

#define AO_CAN_FILTER_MASK_1_17         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_17

#define AO_CAN_FILTER_SID_1_17          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_18

#define AO_CAN_FILTER_EID_1_18          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_18

#define AO_CAN_FILTER_ENABLE_1_18       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_18

#define AO_CAN_FILTER_FIFO_1_18         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_18

#define AO_CAN_FILTER_IDE_1_18          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_18

#define AO_CAN_FILTER_MASK_1_18         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_18

#define AO_CAN_FILTER_SID_1_18          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_19

#define AO_CAN_FILTER_EID_1_19          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_19

#define AO_CAN_FILTER_ENABLE_1_19       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_19

#define AO_CAN_FILTER_FIFO_1_19         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_19

