tinko26/ao/src/ao_sys_xc32_pic32_can/ao_can_1.h
#ifndef AO_CAN_FILTER_ENABLE_1_30

#define AO_CAN_FILTER_ENABLE_1_30       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_30

#define AO_CAN_FILTER_FIFO_1_30         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_30

#define AO_CAN_FILTER_IDE_1_30          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_30

#define AO_CAN_FILTER_MASK_1_30         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_30

#define AO_CAN_FILTER_SID_1_30          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_EID_1_31

#define AO_CAN_FILTER_EID_1_31          (0)

#endif

#ifndef AO_CAN_FILTER_ENABLE_1_31

#define AO_CAN_FILTER_ENABLE_1_31       (false)

#endif

#ifndef AO_CAN_FILTER_FIFO_1_31

#define AO_CAN_FILTER_FIFO_1_31         (0)

#endif

#ifndef AO_CAN_FILTER_IDE_1_31

#define AO_CAN_FILTER_IDE_1_31          (0)

#endif

#ifndef AO_CAN_FILTER_MASK_1_31

#define AO_CAN_FILTER_MASK_1_31         (0)

#endif

#ifndef AO_CAN_FILTER_SID_1_31

#define AO_CAN_FILTER_SID_1_31          (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_0

#define AO_CAN_FILTER_MASK_EID_1_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_1_0

#define AO_CAN_FILTER_MASK_IDE_1_0      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_0

#define AO_CAN_FILTER_MASK_SID_1_0      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_1

#define AO_CAN_FILTER_MASK_EID_1_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_1_1

#define AO_CAN_FILTER_MASK_IDE_1_1      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_1

#define AO_CAN_FILTER_MASK_SID_1_1      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_2

#define AO_CAN_FILTER_MASK_EID_1_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_1_2

#define AO_CAN_FILTER_MASK_IDE_1_2      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_2

#define AO_CAN_FILTER_MASK_SID_1_2      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_FILTER_MASK_EID_1_3

#define AO_CAN_FILTER_MASK_EID_1_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_IDE_1_3

#define AO_CAN_FILTER_MASK_IDE_1_3      (0)

#endif

#ifndef AO_CAN_FILTER_MASK_SID_1_3

#define AO_CAN_FILTER_MASK_SID_1_3      (0)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_INVALID_1

#define AO_CAN_INVALID_1                (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_MODE_1

#define AO_CAN_MODE_1                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_OVERFLOW_1

#define AO_CAN_OVERFLOW_1               (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_RX_1

#define AO_CAN_RX_1                     ((AO_CAN_FIFOS_RX_1) > 0 ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SENT_1

#define AO_CAN_SENT_1                   (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_SYSTEM_1

#define AO_CAN_SYSTEM_1                 (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TIMER_1

#define AO_CAN_TIMER_1                  (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_TX_1

#define AO_CAN_TX_1                     ((AO_CAN_FIFOS_TX_1) > 0 ? true : false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_UNDERFLOW_1

#define AO_CAN_UNDERFLOW_1              (false)

#endif

// ----------------------------------------------------------------------------

#ifndef AO_CAN_WAKE_UP_1

#define AO_CAN_WAKE_UP_1                (false)

#endif

// ----------------------------------------------------------------------------

extern  ao_can_t                        ao_can_buffers_1[AO_CAN_BUFFERS_1];

extern  ao_send_obj_t                   ao_can_in_1     [AO_CAN_FIFOS_RX_1];

extern  ao_recv_obj_t                   ao_can_out_1    [AO_CAN_FIFOS_TX_1];

extern  ao_task_t                       ao_can_task_1;

// ----------------------------------------------------------------------------

// This event is raised, when there is an error on the CAN bus.

// This event is raised every time there is a change in the current error state
// of the CAN module with respect to the CAN network.

// The error states are tracked by the CxTREC register.

// ----------------------------------------------------------------------------

void    ao_can_bus_1(                   ao_can_bus_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_config_1();

void    ao_can_config_baud_1();

void    ao_can_config_fifos_1();

void    ao_can_config_filter_masks_1();

void    ao_can_config_filters_1();

// ----------------------------------------------------------------------------

// This event occurs, when there was an error in the last received message or
// transmitted message.

// However, the specific error is not available to the user application.

// ----------------------------------------------------------------------------

void    ao_can_invalid_1(               ao_can_invalid_info_t const * info);

// ----------------------------------------------------------------------------

void    ao_can_listen_all_1();

// ----------------------------------------------------------------------------

void    ao_can_listen_only_1();

// ----------------------------------------------------------------------------

void    ao_can_loopback_1();

// ----------------------------------------------------------------------------

